all-content.org
#+TITLE: bosabosa
#+STARTUP: logdone
#+HUGO_BASE_DIR: ./

* About
:PROPERTIES:
:EXPORT_HUGO_SECTION: /
:EXPORT_FILE_NAME: about
:EXPORT_HUGO_MENU: :menu "main" :title "About"
:EXPORT_DATE: [2018-10-18 Thu 16:31]
:CUSTOM_ID: about

:END:
** Who am I?

My name is David Daniel Smith and this is my personal website.

** Where have I been? Where am I? And where am I going?
** What is this site?
** Why do I do this?
I like serving my own website instead of using commercial providers. I have done it in various ways since 1999.

** How does this site work?

I wrote a post about [[/posts/make-a-website][how to make a website]] that guides you through creating your own simple website using the same system as this one. It's not as simple as signing up for facebook, but it's close.

# Local Variables:
# org-hugo-auto-export-on-save: t
# End:
