content/about.md
+++
title = "About"
author = ["David Smith"]
lastmod = 2018-10-18T19:40:57-07:00
draft = false
[menu.main]
  weight = 1001
  identifier = "about"
  title = "About"
+++

## Who am I? {#who-am-i}

My name is David Daniel Smith and this is my personal website.


## Where have I been? Where am I? And where am I going? {#where-have-i-been-where-am-i-and-where-am-i-going}


## What is this site? {#what-is-this-site}


## Why do I do this? {#why-do-i-do-this}

I like serving my own website instead of using commercial providers. I have done it in various ways since 1999.


## How does this site work? {#how-does-this-site-work}

I wrote a post about [how to make a website](/posts/make-a-website) that guides you through creating your own simple website using the same system as this one. It's not as simple as signing up for facebook, but it's close.
